[
  {
    "id": 1,
    "title": "Forest: Focus for Productivity",
    "companyName": "FocusLab Ltd.",
    "image": "https://img.icons8.com/clouds/300/apple-app-store.png",
    "description": "Forest helps you stay focused and efficient by gamifying your workflow. Plant a virtual tree when you begin a task — if you stay on track, your tree grows; if you stray, it withers. Over time, you’ll cultivate an entire forest representing your concentration and productivity.\\n\\nWith custom session durations, break intervals, and ambient soundscapes, Forest adapts to your preferred rhythm. Detailed analytics help you see trends in your productivity patterns. You can also tag tasks, set goals, and review historical performance.\\n\\nWhether you’re studying, working, or trying to beat procrastination, Forest turns focus into a rewarding habit. Resist distractions, build consistency, and watch your concentration forest flourish.",
    "size": "125 MB",
    "reviews":"125k",
    "ratingAvg": 4.8,
    "downloads": "5M+",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 160000 }
    ]
  },
  {
    "id": 2,
    "title": "SmPlan: ToDo & Reminder",
    "companyName": "Productive.io",
    "image": "https://img.icons8.com/bubbles/300/spotify.png",
    "description": "SmPlan is a powerful companion for managing tasks, reminders, and productivity flows. Use the built-in Pomodoro style timers, schedule tasks by priority, and get nudges when sessions complete.\\n\\nFor people who struggle with procrastination, SmPlan includes motivational streaks, milestone rewards, and visual progress tracking. Every completed session unlocks achievements, helping you build consistency.\\n\\nThe app supports detailed analytics — see which tasks cost the most energy, track your focus trends, and adjust your workflow accordingly. With background ambient sounds and sleek minimal UI, SmPlan is a personal coach to keep you productive, refreshed, and disciplined.",
    "size": "95 MB",
    "reviews": "50k",
    "ratingAvg": 4.7,
    "downloads": "4.2M+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 90000 }
    ]
  },
  {
    "id": 3,
    "title": "TikTok: Creative Video Platform",
    "companyName": "ByteDance Inc.",
    "image": "https://img.icons8.com/clouds/300/tiktok.png",
    "description": "TikTok enables you to create and explore short videos that entertain, inspire, and spark creativity. Browse trending clips, remix sounds, and build your audience with intuitive editing tools.\\n\\nUse filters, effects, transitions, and audio libraries to make your content pop. Duet or stitch others’ videos to engage in the broader community. Explore by topics like dance, education, travel, and more.\\n\\nWith personalized feeds powered by smart recommendation algorithms, TikTok delivers fresh content tailored to your preferences. Stay inspired, share your voice, and grow your creative presence worldwide.",
    "size": "110 MB",
    "reviews": "800k",
    "ratingAvg": 4.6,
    "downloads": "3.5M+",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 5000 },
      {  "name": "4 star", "count": 25000 }, 
      { "name": "5 star", "count": 95000 }
    ]
  },
  {
    "id": 4,
    "title": "Discord: Chat & Communities",
    "companyName": "Discord Inc.",
    "image": "https://img.icons8.com/clouds/300/discord.png",
    "description": "Discord connects communities, friends, and creators in one unified platform. Join voice channels, text rooms, and media sharing across servers tailored to your interests.\\n\\nCreate private or public servers, assign roles, host live voice chats and video calls, share screen, and integrate bots to automate tasks. Use rich media embedding for links, images, and utilities.\\n\\nWith cross-platform sync, push notifications, and customizable settings, Discord keeps you connected whether you're gaming, collaborating, or socializing.",
    "size": "90MB",
    "reviews": "125k",
    "ratingAvg": 4.8,
    "downloads": "6M+",
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 170000 }
    ]
  },
  {
    "id": 5,
    "title": "Shazam: Identify Songs Instantly",
    "companyName": "Shazam Ltd.",
    "image": "https://img.icons8.com/ios-filled/300/shazam.png",
    "description": "Ever heard a song but didn’t know the name? Shazam listens and identifies tracks in seconds. Tap once and get song title, artist, album, and preview links.\\n\\nAdd songs to Apple Music or Spotify, explore charts, and replay your history. Share discoveries with friends or social platforms.\\n\\nWhether you're in a café, on the street, or watching TV, Shazam ensures you never lose track of music that moves you.",
    "size": "140 MB",
    "reviews": "15k",
    "ratingAvg": 4.7,
    "downloads": "8M+",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 420000 }
    ]
  },
  {
    "id": 6,
    "title": "Workspace One: Remote Productivity",
    "companyName": "VMware Inc.",
    "image": "https://img.icons8.com/color/300/workspace-one.png",
    "description": "Workspace One unifies mobile, desktop, and enterprise workflows in one platform. Access files and applications securely from anywhere.\\n\\nManage devices, enforce policies, and streamline onboarding for remote workers. Use single sign-on, MFA, and conditional access to control entry.\\n\\nCollaborate with tools like built-in messaging, document sharing, and integrated virtual desktops. Workspace One helps organizations stay efficient, secure, and flexible in the hybrid workforce era.",
    "size": "100 MB",
    "reviews": "25k",
    "ratingAvg": 4.5,
    "downloads": "3M+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 7,
    "title": "Ibis Paint X: Digital Art Studio",
    "companyName": "Ibis Inc.",
    "image": "https://img.icons8.com/color/300/ibis-paint-x.png",
    "description": "Ibis Paint X transforms your device into a powerful art studio. Sketch, draw, and paint with over 2500 brushes, filters, layer support, and stabilizers.\\n\\nStream your drawing process live or record time-lapses to review later. Use rulers, symmetry tools, and vector layers to build complex artwork with ease.\\n\\nJoin the Ibis community to share your work, explore tutorials, and challenge creative growth. Whether you're a hobbyist or pro, Ibis Paint X adapts to your style and vision.",
    "size": "120 MB",
    "reviews": "100k",
    "ratingAvg": 4.6,
    "downloads": "7M+",
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 330000 }
    ]
  },
  {
    "id": 8,
    "title": "Ibis Paint X 2: Creative Edition",
    "companyName": "Ibis Creative",
    "image": "https://img.icons8.com/plasticine/300/ibis-paint-x.png",
    "description": "Ibis Paint X 2 enhances the original with premium tools, cloud sync, and enhanced performance. Use gesture commands, higher resolution canvases, and collaborative workspaces.\\n\\nStore your art in the cloud, share projects easily, and sync settings across devices. Advanced brush editors, gradient tools, and texture blending help your pieces stand out.\\n\\nIdeal for digital artists seeking enhanced reliability, Ibis Paint X 2 balances power and ease, letting your creativity flow anywhere.",
    "size": "110 MB",
    "reviews": "55k",
    "ratingAvg": 4.7,
    "downloads": "6.5M+",
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 2500 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 50000 },
      { "name": "5 star", "count": 330000 }
    ]
  },
  {
    "id": 9,
    "title": "Zalo: Chat & Social Connect",
    "companyName": "Zalo Corp",
    "image": "https://img.icons8.com/color/300/zalo.png",
    "description": "Zalo offers seamless messaging, voice calls, video chat, and social media features all in one app. Share photos, stories, and status updates with friends and family.\\n\\nJoin group chats, broadcast across communities, and use built-in translation and voice transcription to communicate smoothly. Use stickers, replays, and location sharing to enrich conversations.\\n\\nWith push notifications, multi-device sync, and end-to-end encryption, Zalo keeps your connections real-time and secure wherever you go.",
    "size": "130 MB",
    "reviews": "65k",
    "ratingAvg": 4.7,
    "downloads": "4.2M+",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 180000 }
    ]
  },
  {
    "id": 10,
    "title": "Shazam Pro: Song Discovery",
    "companyName": "Shazam Ltd.",
    "image": "https://img.icons8.com/color/300/shazam.png",
    "description": "Shazam Pro listens in and identifies songs instantly — even in noisy environments. Get full metadata, lyric sync, streaming integration, and offline mode.\\n\\nUse cross-platform history to track your discoveries. Share your finds, or add songs to playlists on your favorite music services.\\n\\nPerfect for music lovers, Shazam Pro helps you rediscover tracks you hear anywhere and never lose a beat.",
    "size": "125 MB",
    "reviews": "15k",
    "ratingAvg": 4.6,
    "downloads": "3.8M+",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 123000 }
    ]
  },
  {
    "id": 11,
    "title": "GoodNotes: Digital Notepad",
    "companyName": "Time Base Tech",
    "image": "https://img.icons8.com/color/300/goodnotes.png",
    "description": "GoodNotes brings handwriting, typed notes, and PDF annotation into one seamless experience. Create notebooks, import files, and annotate with precision.\\n\\nUse layers, shape detection, and text conversion for polished output. Organize your notebooks with folders, tags, and search across all content.\\n\\nSync across devices securely and export your work to standard formats. GoodNotes ensures your thoughts, ideas, and lectures stay organized and accessible.",
    "size": "110 MB",
    "reviews":"95k",
    "ratingAvg": 4.5,
    "downloads": "3M+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 12,
    "title": "Canva: Design Creator",
    "companyName": "Canva Pty Ltd",
    "image": "https://img.icons8.com/clouds/300/canva.png",
    "description": "Canva is your all-in-one design canvas — create social media posts, presentations, posters, and beyond with ease. Use thousands of templates, images, icons, and fonts to get started in seconds.\\n\\nCustomize layouts, add animations, and collaborate with team members in real time. Export to image, PDF, or video formats.\\n\\nPerfect for beginners and pros alike, Canva turns design into a joyful, collaborative experience everywhere you go.",
    "size": "140 MB",
    "reviews": "125k",
    "ratingAvg": 4.7,
    "downloads": "4.2M+",
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 180000 }
    ]
  },
  {
    "id": 13,
    "title": "YouTube: Stream & Share",
    "companyName": "Google LLC",
    "image": "https://img.icons8.com/clouds/300/youtube.png",
    "description": "YouTube is the world’s leading video platform — watch, upload, and monetize content across every niche. Explore channels, playlists, shorts, and live streams in an easy interface.\\n\\nSubscribe, comment, and engage with creators — share, like, and save videos. Use playlists, offline mode, and adaptive streaming to suit your connection.\\n\\nCreators can manage channels, upload content, monitor analytics, and interact with audiences. YouTube blends entertainment, education, and creativity in a global platform.",
    "size": "150 MB",
    "reviews": "125k",
    "ratingAvg": 4.8,
    "downloads": "8M+",
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 60000 },
      { "name": "5 star", "count": 420000 }
    ]
  },
  {
    "id": 14,
    "title": "Radish: Story & Novel Reader",
    "companyName": "Radish Media",
    "image": "https://img.icons8.com/clouds/300/radish-app.png",
    "description": "Radish offers serialized fiction, short stories, and novels delivered episodically. Read works by emerging and established authors across genres like romance, fantasy, and thriller.\\n\\nAccess premium chapters, join story communities, and support creators. Use offline reading, bookmarks, and reading reminders to keep your habit consistent.\\n\\nWhether you want bite-sized storytelling or deep narratives, Radish keeps you coming back for more with engaging, episodic content.",
    "size": "120 MB",
    "reviews": "125k",
    "ratingAvg": 4.5,
    "downloads": "3.5M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 15,
    "title": "Zalo Pro: Messaging Hub",
    "companyName": "Zalo Corp",
    "image": "https://img.icons8.com/bubbles/300/zalo.png",
    "description": "Zalo Pro brings advanced messaging, multimedia sharing, and social networking together. Conduct high-quality video calls, send large file attachments, and collaborate with group chats.\\n\\nUse ephemeral stories, status updates, polls, and interactive stickers. Translate languages instantly and view transcripts for voice messages.\\n\\nSecure your chats with biometric locking and encryption. Zalo Pro offers a robust, modern communication hub for friends, families, and professionals.",
    "size": "135 MB",
    "reviews": "25k",
    "ratingAvg": 4.5,
    "downloads": "3.6M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 105000 }
    ]
  },
  {
    "id": 16,
    "title": "Google Docs: Editor & Collaboration",
    "companyName": "Google LLC",
    "image": "https://img.icons8.com/dusk/300/google-docs.png",
    "description": "Google Docs lets you create, edit, and collaborate in real time. Work on documents with teams, track changes, and comment without leaving your flow.\\n\\nAccess across devices, offline sync, and version history ensure your work is always backed up. Use smart suggestions, templates, and add-ons to enhance productivity.\\n\\nGoogle’s cloud backbone powers secure storage, sharing, and integration with Sheets, Slides, Drive, and more. Docs is your versatile, modern writing workspace.",
    "size": "125 MB",
    "reviews": "5k",
    "ratingAvg": 4.7,
    "downloads": "4M+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 110000 }
    ]
  },
  {
    "id": 17,
    "title": "Apple Books: Read & Explore",
    "companyName": "Apple Inc.",
    "image": "https://img.icons8.com/plasticine/300/apple-books.png",
    "description": "Apple Books turns your device into a personal library. Browse fiction, non-fiction, comics, and textbooks with intuitive controls.\\n\\nHighlight passages, take notes, and sync reading position across Apple devices. Access audiobooks, daily deals, and curated collections.\\n\\nWith night mode, variable fonts, and accessibility support, Apple Books makes reading comfortable and immersive each time you open it.",
    "size": "135 MB",
    "reviews": "125k",
    "ratingAvg": 4.6,
    "downloads": "3.8M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 18,
    "title": "Tinder: Swipe to Connect",
    "companyName": "MatchTech Inc.",
    "image": "https://img.icons8.com/clouds/300/--tinder.png",
    "description": "Tinder offers seamless ways to meet new people — swipe right on profiles you like, left to pass. If two users like each other, it’s a match — start chatting instantly.\\n\\nAdd photos, bio prompts, and preferences to shape your profile. Use features like Boost, Super Like, and Passport to expand your reach.\\n\\nPrivacy-first by design: control who sees your profile, hide from search, or limit visibility by distance and age. Tinder balances spontaneity, connection, and safety in one app.",
    "size": "130 MB",
    "reviews": "100k",
    "ratingAvg": 4.5,
    "downloads": "3.5M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 14000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 19,
    "title": "Radish Lite: Stories Anytime",
    "companyName": "Radish Media",
    "image": "https://img.icons8.com/clouds/300/radish-app.png",
    "description": "Radish Lite gives you access to serialized stories and novels for free or limited access. Explore chapters, engage with authors, and join reading communities.\\n\\nSave favorites, receive reading reminders, and unlock premium content over time.\\n\\nSwitch between night and day modes, adjust typography, and immerse yourself in compelling storytelling wherever you go.",
    "size": "110 MB",
    "reviews": "105k",
    "ratingAvg": 4.5,
    "downloads": "3M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 20,
    "title": "YouTube Play: Watch & Share",
    "companyName": "Google LLC",
    "image": "https://img.icons8.com/pulsar-gradient/300/youtube-play.png",
    "description": "YouTube Play offers a streamlined video experience. Watch trending clips, discover new creators, or browse your subscribed feed.\\n\\nUse picture-in-picture mode, queue up playlists, and enjoy continuous viewing while multitasking.\\n\\nUpload short-form videos or edits directly from your device, manage comments, and track viewer engagement. YouTube Play keeps the essentials fast and fun.",
    "size": "140 MB",
    "reviews": "125k",
    "ratingAvg": 4.7,
    "downloads": "6M+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 165000 }
    ]
  },
  {
    "id": 21,
    "title": "Google Docs Pro",
    "companyName": "Google LLC",
    "image": "https://img.icons8.com/dusk/300/google-docs.png",
    "description": "Google Docs Pro includes advanced collaboration, offline-first features, and AI-assisted writing. Draft, edit, and share documents with powerful tools like version compare, smart suggestions, and integrated libraries.\\n\\nCollaborate in real time, comment, and tag team members. With offline fallback and automatic sync, your work is never lost.\\n\\nBuilt on Google’s cloud infrastructure, this edition is optimized for teams, students, and professionals who demand more from their writing platform.",
    "size": "120 MB",
    "reviews": "125k",
    "ratingAvg": 4.6,
    "downloads": "3.5M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 22,
    "title": "Apple Books Pro",
    "companyName": "Apple Inc.",
    "image": "https://img.icons8.com/plasticine/300/apple-books.png",
    "description": "Apple Books Pro offers enhanced reading features: listen with audiobook integration, annotate in margin, and build custom collections. Use advanced search, cross-device sync, and curated reading lists.\\n\\nBuy, borrow, or subscribe to premium content; preview chapters before purchase. With immersive reading modes, typography control, and accessibility support, Apple Books Pro is your refined literary hub.",
    "size": "125 MB",
    "reviews": "125k",
    "ratingAvg": 4.5,
    "downloads": "3.2M+",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 95000 }
    ]
  },
  {
    "id": 23,
    "title": "Radish Reader: Stories & Novels",
    "companyName": "Radish Media",
    "image": "https://img.icons8.com/clouds/300/radish-app.png",
    "description": "Radish Reader packs full access to serialized fiction, interactive stories, and community content. Enjoy exclusive chapters, curated collections, and bonus features.\\n\\nComment within chapters, vote on story directions, and engage directly with authors. Save to your library, set reading goals, and resume where you left off.\\n\\nWith offline mode, night reading, and typography settings, Radish Reader is the flexible storytelling platform for casual or serious readers alike.",
    "size": "140 MB",
    "reviews": "65K",
    "ratingAvg": 4.7,
    "downloads": "5M+",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 180000 }
    ]
  },
  {
    "id": 24,
    "title": "Zalo Buddy: Chat & Media",
    "companyName": "VNG Corp",
    "image": "https://img.icons8.com/bubbles/300/zalo.png",
    "description": "Zalo Buddy offers lightweight messaging, media sharing, and community features with optimized performance. Send voice notes, images, stickers, and links with ease.\\n\\nCreate group chats, subscribe to broadcast channels, and follow friends’ updates. Use in-app translation, quick replies, and status posts to share life moments.\\n\\nSync across devices, secure chats with encryption, and manage your data with minimal memory footprint. Zalo Buddy keeps you connected without bulk or lag.",
    "size": "130 MB",
    "reviews": "125K",
    "ratingAvg": 4.6,
    "downloads": "3.8M+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 105000 }
    ]
  },
  {
    "id": 25,
    "title": "GoodNotes Pro: Write & Organize",
    "companyName": "Time Base Tech",
    "image": "https://img.icons8.com/color/300/goodnotes.png",
    "description": "GoodNotes Pro elevates note-taking with AI summarization, cross-doc linking, and advanced annotation. Import PDFs, images, and slides and annotate with precision tools.\\n\\nOrganize your digital notebooks using nested folders, tags, and smart search. Use handwriting-to-text conversion, shape recognition, and synced backups.\\n\\nWhether you’re students, professionals, or researchers, GoodNotes Pro is your all-in-one writing and planning center.",
    "size": "120 MB",
    "reviews": "125K",
    "ratingAvg": 4.6,
    "downloads": "3.5M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "id": 26,
    "title": "Canva Pro: Design & Collaborate",
    "companyName": "Canva Pty Ltd",
    "image": "https://img.icons8.com/clouds/300/canva.png",
    "description": "Canva Pro unlocks premium templates, team collaboration, version history, and asset libraries. Design flyers, videos, web banners, and more with professional-grade features.\\n\\nInvite collaborators, comment on designs, and co-edit in real time. Use brand kits, color palettes, and export presets tailored to your needs.\\n\\nWhether you’re building content for marketing, education, or personal use, Canva Pro scales with your creativity and team workflow.",
    "size": "140 MB",
    "reviews": "125K",
    "ratingAvg": 4.7,
    "downloads": "5M+",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 180000 }
    ]
  },
  {
    "id": 27,
    "title": "YouTube Music: Stream & Discover",
    "companyName": "Google LLC",
    "image": "https://img.icons8.com/clouds/300/youtube.png",
    "description": "YouTube Music brings official songs, albums, playlists, and videos right to your fingertips. Stream free with ads or upgrade for ad-free playback and offline listening.\\n\\nExplore personalized mixes, live performances, and trending charts. Use smart search to find songs even when you only remember a few lyrics.\\n\\nSeamlessly switch between audio and video modes. This app blends YouTube’s vast catalog with a refined music streaming experience.",
    "size": "150 MB",
    "reviews": "60K",
    "ratingAvg": 4.8,
    "downloads": "10M+",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 560000 }
    ]
  },
  {
    "id": 28,
    "title": "Forest Timer: Focus & Grow",
    "companyName": "FocusLab Ltd.",
    "image": "https://img.icons8.com/clouds/300/apple-app-store.png",
    "description": "Forest Timer is a productivity tool combining focus timers with task planning. Grow your virtual forest as you stay on track, and use detailed insights to refine your habits.\\n\\nSet daily goals, block distractions, and unlock achievements when you meet consistency. Use ambient sounds, themes, and scheduling to tailor the experience.\\n\\nForest Timer encourages you to stay present and disciplined — working smarter, not harder — by turning every session into growth.",
    "size": "130 MB",
    "reviews": "125K",
    "ratingAvg": 4.5,
    "downloads": "3.5M+",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 14000 },
      { "name": "5 star", "count": 100000 }
    ]
  }
]
